{"spray": 1467, "smells": 1432, "goes": 626, "fine": 546, "feels": 533, "need": 1000, "lot": 898, "texture": 1571, "hair": 649, "medium": 947, "thickness": 1577, "brands": 152, "chemicals": 217, "stick": 1493, "lot hair": 899, "wish": 1723, "coconut": 254, "smell": 1429, "having": 693, "head": 694, "orange": 1044, "coffee": 256, "described": 387, "hoping": 736, "light": 861, "felt": 538, "synthetic": 1540, "polish": 1128, "apply": 56, "smoothly": 1435, "let": 855, "dry": 429, "overnight": 1056, "adding": 19, "second": 1323, "coat": 252, "makeup": 926, "removal": 1244, "travel": 1616, "lightweight": 867, "small": 1427, "liking": 872, "preferred": 1147, "make": 916, "reason": 1220, "salon": 1302, "twice": 1638, "week": 1707, "month": 980, "absolutely": 2, "skin": 1408, "smooth": 1433, "silky": 1393, "follow": 569, "instructions": 780, "begin": 116, "definitely": 378, "help": 709, "save": 1307, "long": 889, "run": 1294, "skin feels": 1413, "feels smooth": 535, "treatments": 1621, "market": 934, "shampoo": 1355, "free": 582, "makes": 921, "feel": 529, "wants": 1681, "improve": 758, "appearance": 49, "fragrance": 580, "makes hair": 924, "hair feel": 656, "silky smooth": 1394, "disappointed": 405, "facial": 506, "scrub": 1316, "scrubs": 1318, "wasn": 1690, "powder": 1141, "mix": 967, "water": 1693, "face": 500, "shower": 1386, "extra": 484, "step": 1492, "work": 1734, "far": 521, "scrubbing": 1317, "real": 1214, "biggest": 125, "plus": 1125, "won": 1726, "moisturizing": 977, "lotion": 900, "lightly": 865, "absorbed": 4, "softer": 1442, "smoother": 1434, "allows": 37, "base": 98, "applied": 54, "sized": 1405, "cover": 319, "entire": 458, "neck": 999, "types": 1642, "women": 1725, "men": 948, "absorbed skin": 5, "skin skin": 1417, "face neck": 504, "months": 981, "honestly": 729, "getting": 608, "saw": 1308, "excited": 473, "difficult": 398, "impossible": 756, "straight": 1505, "iron": 785, "sides": 1390, "couldn": 314, "ingredients": 775, "actual": 15, "treatment": 1620, "conditioner": 289, "sold": 1444, "separate": 1342, "wash": 1683, "strip": 1512, "regular": 1236, "shampoo conditioner": 1356, "brush": 165, "wood": 1730, "boar": 140, "bristle": 158, "son": 1448, "loves": 905, "brushes": 167, "keeps": 800, "compact": 276, "size": 1404, "center": 200, "car": 186, "tried": 1623, "actually": 16, "care": 187, "cleanser": 239, "toner": 1600, "cream": 326, "eye": 487, "overall": 1054, "quite": 1201, "surprised": 1535, "start": 1481, "finish": 551, "routine": 1289, "package": 1060, "instead": 779, "working": 1736, "various": 1666, "particularly": 1077, "comes": 271, "beautiful": 111, "gift": 609, "box": 149, "wonderful": 1727, "mother": 983, "law": 831, "plan": 1113, "skin care": 1409, "eye cream": 489, "thrilled": 1584, "able": 1, "bags": 88, "dark": 359, "circles": 228, "eyes": 496, "weeks": 1708, "happy": 684, "place": 1109, "come": 270, "wet": 1713, "supposed": 1531, "placed": 1110, "stay": 1485, "falling": 515, "course": 318, "maybe": 943, "read": 1210, "stay place": 1486, "straightener": 1508, "heats": 704, "quickly": 1199, "evenly": 466, "curl": 335, "naturally": 994, "wavy": 1696, "fits": 555, "hand": 672, "heat": 703, "pink": 1107, "perfectly": 1090, "wavy hair": 1697, "ear": 439, "large": 818, "handy": 679, "store": 1503, "organic": 1048, "strong": 1514, "fall": 514, "apart": 47, "tips": 1593, "honest": 727, "typically": 1644, "morning": 982, "night": 1009, "serum": 1344, "kind": 806, "immediately": 754, "moisture": 971, "starting": 1483, "minutes": 963, "sleep": 1421, "allow": 36, "putting": 1193, "thicker": 1576, "type": 1641, "needs": 1002, "supple": 1528, "difference": 397, "sure": 1532, "looked": 893, "positive": 1137, "thought": 1582, "days": 369, "vitamin": 1676, "retinol": 1262, "followed": 570, "applying": 57, "serums": 1345, "started": 1482, "roller": 1280, "noticed": 1018, "puffiness": 1177, "area": 59, "pores": 1135, "absorb": 3, "faster": 524, "continue": 302, "going": 631, "forward": 578, "impressed": 757, "results": 1261, "wasn sure": 1691, "cute": 349, "kit": 809, "leather": 840, "pouch": 1140, "quality": 1194, "manicure": 931, "nail": 988, "man": 929, "nails": 991, "file": 541, "prefer": 1146, "stocking": 1498, "christmas": 227, "reasonable": 1221, "price": 1153, "make gift": 917, "combo": 268, "giving": 615, "mouth": 984, "gum": 648, "health": 700, "issues": 792, "past": 1081, "ones": 1034, "taking": 1547, "brushing": 168, "removes": 1248, "simple": 1397, "air": 34, "items": 795, "bar": 94, "toothbrush": 1606, "mentioned": 950, "smaller": 1428, "stopped": 1501, "older": 1032, "teeth": 1559, "clean": 233, "happen": 681, "electric": 452, "case": 192, "manual": 932, "went": 1711, "feel clean": 530, "colors": 265, "new": 1005, "eyebrows": 492, "today": 1595, "baby": 85, "gorgeous": 634, "loved": 903, "eyebrow": 491, "pen": 1087, "tweezers": 1637, "brow": 162, "bonus": 144, "thank": 1572, "longer": 892, "bigger": 124, "expect": 477, "live": 885, "tiny": 1591, "original": 1049, "special": 1456, "unfortunately": 1648, "return": 1263, "dont": 419, "waste": 1692, "butter": 178, "shea": 1364, "softens": 1441, "shea butter": 1365, "blade": 130, "razor": 1206, "hold": 719, "hard": 685, "plastic": 1115, "shave": 1361, "style": 1518, "total": 1608, "tea": 1556, "bag": 87, "surprise": 1534, "short": 1379, "matter": 942, "big": 122, "crazy": 325, "daughters": 366, "taken": 1545, "deal": 372, "simply": 1398, "garbage": 596, "pay": 1083, "cheap": 211, "version": 1670, "shiny": 1375, "literally": 884, "bad": 86, "photos": 1098, "life": 859, "color": 261, "opinion": 1039, "paint": 1071, "strips": 1513, "worst": 1742, "completely": 283, "fell": 537, "loss": 896, "expected": 478, "right": 1272, "trash": 1615, "pass": 1080, "update": 1653, "useful": 1657, "personal": 1095, "experience": 481, "reviewed": 1267, "item": 794, "outside": 1053, "receive": 1226, "available": 77, "visible": 1675, "reviewer": 1268, "regularly": 1237, "doing": 417, "amazon": 42, "including": 765, "likes": 871, "line": 873, "hair shiny": 664, "set": 1347, "mom": 978, "fun": 593, "old": 1031, "school": 1314, "foam": 567, "styling": 1520, "hair fine": 659, "short hair": 1380, "tool": 1604, "toes": 1596, "fingers": 550, "files": 542, "useless": 1658, "green": 640, "blue": 138, "fan": 519, "carry": 190, "leak": 836, "bottle": 146, "fit": 554, "pocket": 1126, "alot": 40, "ways": 1699, "arrived": 67, "shape": 1358, "purse": 1191, "tight": 1588, "normally": 1012, "leaves": 844, "thinner": 1579, "masks": 937, "expecting": 479, "ordered": 1046, "daughter": 363, "natural": 992, "weight": 1709, "lashes": 821, "length": 853, "light weight": 863, "pack": 1059, "haven": 691, "worn": 1738, "comment": 275, "dried": 423, "fast": 522, "bend": 118, "brows": 164, "lay": 832, "included": 763, "match": 939, "lines": 875, "adorable": 27, "words": 1732, "single": 1399, "pins": 1108, "broke": 160, "threw": 1583, "careful": 188, "similar": 1396, "mask": 936, "multi": 986, "bands": 92, "lose": 895, "loving": 906, "sensitive": 1338, "usual": 1661, "caused": 197, "dryness": 434, "absorbs": 6, "burning": 177, "fine lines": 548, "skin sensitive": 1416, "absorbs quickly": 7, "everyday": 468, "cologne": 260, "wife": 1717, "gave": 597, "friend": 586, "shine": 1374, "colored": 262, "value": 1663, "rough": 1287, "support": 1530, "nose": 1013, "covered": 321, "fabric": 498, "isn": 790, "took": 1603, "curls": 339, "rollers": 1281, "day": 367, "hot": 738, "hair long": 662, "basically": 102, "cleaning": 236, "stays": 1489, "blades": 131, "stars": 1480, "pulled": 1181, "tough": 1611, "spot": 1465, "removing": 1249, "realize": 1217, "problem": 1162, "blush": 139, "personally": 1096, "changing": 207, "pictures": 1102, "guess": 647, "eyeshadow": 497, "expensive": 480, "collection": 259, "play": 1117, "big deal": 123, "claim": 230, "sticky": 1496, "gives": 614, "ago": 33, "extremely": 486, "touch": 1610, "idea": 752, "hope": 731, "left": 849, "hair feels": 658, "originally": 1050, "feet": 536, "given": 613, "cracked": 323, "hurt": 744, "effects": 449, "possible": 1138, "worried": 1739, "away": 81, "helps": 713, "round": 1288, "black": 128, "turned": 1635, "brown": 163, "couple": 316, "suggest": 1524, "leave": 841, "oil": 1026, "scalp": 1310, "roots": 1284, "odor": 1023, "cap": 184, "dark brown": 360, "couple days": 317, "leave hair": 842, "lip": 877, "gloss": 620, "action": 14, "hydrating": 750, "slight": 1423, "sheer": 1368, "haven noticed": 692, "luxurious": 909, "creamy": 328, "glass": 617, "jar": 797, "irritate": 786, "heavier": 705, "user": 1659, "anti": 44, "aging": 32, "sensitive skin": 1339, "anti aging": 45, "oils": 1027, "mixed": 968, "feeling": 532, "greasy": 639, "oily": 1028, "pleasant": 1118, "scent": 1311, "bother": 145, "pleasant scent": 1119, "mid": 954, "creams": 327, "chest": 218, "improvement": 759, "consistency": 294, "hands": 678, "washed": 1686, "tell": 1560, "job": 798, "seen": 1331, "noticeable": 1017, "changes": 206, "balm": 90, "perfume": 1092, "problems": 1163, "citrus": 229, "scents": 1313, "flowers": 566, "leave skin": 843, "skin feeling": 1412, "heavy": 707, "goes away": 627, "skin leaves": 1415, "leaves skin": 846, "enjoy": 456, "sugar": 1523, "container": 299, "consider": 292, "sample": 1304, "coarse": 251, "exfoliating": 475, "coats": 253, "slippery": 1426, "floor": 563, "level": 856, "travel size": 1617, "detect": 393, "sweet": 1538, "notes": 1015, "end": 453, "attractive": 76, "lid": 857, "plain": 1112, "body": 141, "shaped": 1359, "clear": 241, "stand": 1477, "early": 440, "minimal": 960, "runny": 1296, "non": 1010, "irritating": 788, "causing": 199, "wouldn": 1743, "delicate": 379, "eye area": 488, "wearing": 1702, "refreshing": 1233, "beauty": 113, "ready": 1213, "world": 1737, "wore": 1733, "bathroom": 105, "remove": 1245, "sensitivity": 1340, "thankfully": 1573, "cut": 348, "gotten": 635, "wear": 1701, "messy": 952, "bun": 174, "holds": 723, "inside": 777, "holds hair": 724, "recently": 1227, "website": 1705, "okay": 1030, "floral": 564, "scented": 1312, "fragrances": 581, "depending": 386, "concept": 286, "fairly": 512, "aren": 61, "rub": 1290, "wipe": 1721, "interesting": 784, "subtle": 1521, "hint": 717, "caught": 195, "traveling": 1618, "wipes": 1722, "effective": 448, "cleansing": 240, "open": 1036, "skincare": 1420, "neutral": 1004, "linger": 876, "quickly skin": 1200, "sizes": 1406, "usually": 1662, "moisturizers": 975, "foaming": 568, "moisturizer": 974, "washing": 1688, "later": 827, "discovered": 411, "setting": 1350, "typical": 1643, "individual": 769, "pricey": 1157, "set comes": 1348, "gel": 599, "polishes": 1130, "variety": 1665, "shows": 1388, "tape": 1553, "opening": 1038, "pleased": 1122, "home": 726, "staying": 1488, "ears": 441, "headband": 695, "comfortable": 272, "stretch": 1510, "buttons": 180, "loose": 894, "attention": 75, "helpful": 711, "face mask": 503, "brand": 151, "sanitizer": 1305, "pump": 1184, "dispenser": 413, "bottles": 147, "alcohol": 35, "overpowering": 1057, "hand sanitizer": 674, "pump dispenser": 1185, "evening": 465, "acne": 12, "essential": 462, "ingredient": 774, "lavender": 830, "quicker": 1198, "nearly": 996, "essential oil": 463, "dry skin": 431, "right away": 1273, "hydrates": 749, "headbands": 696, "larger": 819, "require": 1254, "bow": 148, "washing face": 1689, "daily": 355, "ordering": 1047, "barely": 95, "drying": 433, "issue": 791, "tacky": 1542, "moisturize": 972, "flat": 557, "grip": 643, "body lotion": 142, "summer": 1525, "decided": 374, "grow": 644, "bangs": 93, "adult": 28, "hairspray": 669, "needed": 1001, "order": 1045, "huge": 742, "standard": 1478, "mist": 966, "flexible": 560, "hold hair": 720, "eyelashes": 494, "eyelash": 493, "growth": 646, "change": 204, "necessary": 998, "gentle": 605, "nicely": 1006, "lather": 828, "notice": 1016, "winter": 1720, "fact": 507, "heads": 697, "settings": 1351, "bristles": 159, "firm": 553, "leaving": 847, "dropper": 427, "applicator": 53, "takes": 1546, "half": 670, "white": 1715, "break": 153, "press": 1148, "mild": 956, "husband": 745, "options": 1043, "knew": 810, "previous": 1151, "based": 100, "company": 278, "contact": 297, "customer": 345, "feature": 526, "number": 1020, "towel": 1612, "towels": 1613, "material": 940, "tend": 1562, "chin": 221, "daughter hair": 364, "wet hair": 1714, "jade": 796, "awkward": 84, "piece": 1103, "metal": 953, "sturdy": 1517, "directions": 401, "cold": 257, "counter": 315, "entirely": 459, "true": 1629, "especially": 460, "mascara": 935, "gently": 606, "girls": 612, "came": 183, "lasts": 824, "rate": 1203, "drop": 426, "led": 848, "realized": 1218, "hours": 740, "nail polish": 990, "gel polish": 600, "favorite": 525, "cause": 196, "seconds": 1324, "rinsing": 1277, "unless": 1651, "turn": 1634, "rich": 1270, "moving": 985, "slightly": 1424, "mirror": 964, "blackheads": 129, "gone": 633, "wrinkles": 1747, "younger": 1753, "dispense": 412, "hydrated": 748, "sweat": 1537, "rubbed": 1291, "burn": 176, "stop": 1500, "exchange": 471, "unbiased": 1645, "opinions": 1040, "make skin": 919, "exchange honest": 472, "honest unbiased": 728, "peel": 1085, "foot": 572, "wanting": 1680, "rubber": 1292, "stayed": 1487, "figure": 539, "attached": 73, "somewhat": 1447, "smelled": 1430, "combination": 267, "process": 1164, "soak": 1437, "peeling": 1086, "discounted": 409, "discounted price": 410, "sheet": 1369, "individually": 770, "wrapped": 1746, "layers": 834, "layer": 833, "paper": 1075, "point": 1127, "spread": 1472, "wait": 1678, "lack": 816, "pain": 1069, "add": 17, "reduced": 1231, "purpose": 1189, "reviewing": 1269, "sheet masks": 1371, "sheet mask": 1370, "spots": 1466, "tan": 1549, "residue": 1257, "seeing": 1330, "age": 31, "result": 1260, "happens": 683, "acrylic": 13, "space": 1454, "cosmetics": 310, "prior": 1159, "finding": 545, "quick": 1197, "inches": 761, "wide": 1716, "deep": 377, "solid": 1445, "local": 886, "stores": 1504, "priced": 1156, "probably": 1161, "ended": 454, "addition": 20, "storage": 1502, "liner": 874, "neat": 997, "reduce": 1230, "opportunity": 1041, "uses": 1660, "finger": 549, "list": 882, "major": 915, "natural ingredients": 993, "replace": 1250, "elastic": 451, "band": 91, "adjustable": 25, "eventually": 467, "rest": 1259, "generous": 604, "concerned": 287, "important": 755, "keeping": 799, "reminds": 1243, "olive": 1033, "faded": 509, "charging": 210, "cord": 307, "cleaner": 235, "spa": 1453, "gets": 607, "sink": 1400, "hair gets": 660, "wash face": 1684, "seller": 1334, "button": 179, "surface": 1533, "label": 814, "chip": 223, "art": 68, "nail art": 989, "thinning": 1580, "rose": 1286, "incredibly": 768, "lift": 860, "pull": 1179, "considering": 293, "places": 1111, "pick": 1099, "correct": 308, "flavor": 559, "remover": 1247, "carrying": 191, "cons": 291, "display": 414, "disappointment": 407, "customers": 347, "polish remover": 1129, "dries": 424, "description": 388, "damaged": 357, "happened": 682, "packed": 1063, "hoped": 733, "regardless": 1235, "halloween": 671, "test": 1568, "pigment": 1105, "shade": 1352, "lips": 879, "leaves hair": 845, "hair feeling": 657, "wax": 1698, "soap": 1439, "easier": 443, "practice": 1144, "picture": 1100, "dry hair": 430, "waves": 1695, "hair face": 655, "wig": 1718, "hairs": 668, "annoying": 43, "grab": 636, "making": 928, "ball": 89, "tree": 1622, "coconut oil": 255, "tea tree": 1557, "decent": 373, "manageable": 930, "negative": 1003, "food": 571, "reading": 1212, "finally": 544, "glad": 616, "reactions": 1209, "granddaughter": 637, "liked": 869, "sunscreen": 1527, "running": 1295, "goes smooth": 629, "power": 1142, "usb": 1656, "requires": 1255, "battery": 107, "protect": 1169, "frizz": 589, "hair wet": 666, "hair dry": 653, "light scent": 862, "straighten": 1507, "red": 1228, "turns": 1636, "flat iron": 558, "clippers": 245, "includes": 764, "sharp": 1360, "particular": 1076, "overly": 1055, "artificial": 69, "extensions": 483, "lasting": 823, "long lasting": 891, "combs": 269, "cheaper": 212, "shoulder": 1383, "shoulder length": 1384, "length hair": 854, "research": 1256, "lost": 897, "young": 1752, "family": 517, "breaking": 154, "face feels": 502, "tangles": 1552, "ounce": 1051, "remember": 1242, "damage": 356, "near": 995, "photo": 1097, "asin": 70, "essence": 461, "minute": 962, "handle": 676, "kept": 802, "prevent": 1150, "irritation": 789, "packaged": 1061, "application": 51, "awhile": 83, "heavily": 706, "lip balm": 878, "experienced": 482, "hopefully": 734, "risk": 1278, "cost": 311, "fantastic": 520, "uncomfortable": 1646, "gold": 632, "current": 342, "current price": 343, "silk": 1392, "scrunchies": 1319, "basic": 101, "slide": 1422, "delivers": 382, "long hair": 890, "wrong": 1749, "hate": 690, "note": 1014, "double": 420, "packaging": 1062, "ounces": 1052, "flip": 562, "glue": 624, "fully": 592, "protected": 1170, "comb": 266, "silicone": 1391, "pulls": 1183, "pure": 1187, "argan": 62, "massage": 938, "argan oil": 63, "compared": 279, "reasons": 1224, "brush hair": 166, "blending": 134, "sponges": 1464, "applications": 52, "blend": 132, "foundation": 579, "pencil": 1088, "gifts": 610, "mention": 949, "sponge": 1463, "feel skin": 531, "contains": 301, "close": 247, "functional": 594, "high": 714, "saying": 1309, "girl": 611, "roll": 1279, "self": 1332, "wrap": 1745, "bunch": 175, "versatile": 1669, "designed": 390, "adhesive": 23, "lovely": 904, "liquid": 881, "previously": 1152, "tip": 1592, "ends": 455, "blends": 135, "sell": 1333, "currently": 344, "feels skin": 534, "videoid": 1673, "bath": 104, "throw": 1585, "hardly": 687, "aroma": 65, "lasted": 822, "initially": 776, "mind": 957, "people": 1089, "hand soap": 675, "appear": 48, "clay": 232, "design": 389, "curly": 340, "silver": 1395, "pictured": 1101, "tightly": 1589, "shorter": 1381, "shown": 1387, "sent": 1341, "satisfied": 1306, "curly hair": 341, "fine hair": 547, "holding": 722, "holder": 721, "reasonably": 1222, "unlike": 1652, "hour": 739, "price reasonable": 1155, "unique": 1649, "tube": 1632, "lipstick": 880, "shedding": 1367, "star": 1479, "pieces": 1104, "sense": 1337, "sets": 1349, "high quality": 715, "room": 1282, "soothing": 1450, "handles": 677, "tad": 1543, "relatively": 1238, "chemical": 216, "sheets": 1372, "causes": 198, "aloe": 38, "mini": 959, "matte": 941, "purple": 1188, "caps": 185, "lots": 902, "waterproof": 1694, "runs": 1297, "clip": 244, "sort": 1452, "accidentally": 9, "hair hair": 661, "tubes": 1633, "fresh": 585, "cucumber": 331, "reasonably priced": 1223, "middle": 955, "forehead": 573, "appears": 50, "cloth": 249, "coming": 274, "tie": 1586, "kid": 804, "horrible": 737, "lathers": 829, "bars": 97, "sun": 1526, "spf": 1461, "gels": 601, "wand": 1679, "pressure": 1149, "yes": 1751, "condition": 288, "hair brush": 650, "solution": 1446, "provided": 1174, "woman": 1724, "despite": 392, "chance": 203, "slip": 1425, "option": 1042, "additional": 21, "bring": 157, "shipped": 1376, "ties": 1587, "tail": 1544, "hair ties": 665, "pop": 1134, "hair work": 667, "provide": 1173, "shadow": 1354, "essential oils": 464, "pale": 1073, "changed": 205, "knows": 812, "faint": 510, "yellow": 1750, "squeeze": 1474, "ease": 442, "shed": 1366, "believe": 117, "range": 1202, "forget": 575, "colorful": 263, "pads": 1066, "clips": 246, "gloves": 622, "rating": 1204, "thinking": 1578, "unit": 1650, "held": 708, "temperature": 1561, "complete": 282, "accessories": 8, "missing": 965, "hair clips": 651, "stainless": 1476, "steel": 1491, "bubble": 169, "added": 18, "spray bottles": 1469, "spray bottle": 1468, "cat": 193, "built": 171, "hang": 680, "exfoliate": 474, "cleans": 237, "certainly": 202, "korean": 813, "listed": 883, "ton": 1598, "surprisingly": 1536, "lids": 858, "moisturized": 973, "lock": 887, "quartz": 1196, "produce": 1165, "flower": 565, "mess": 951, "information": 772, "creating": 330, "purposes": 1190, "aware": 80, "holes": 725, "lower": 908, "provides": 1176, "blow": 137, "removed": 1246, "secure": 1326, "portable": 1136, "dye": 438, "vibrant": 1671, "hit": 718, "hand cream": 673, "plant": 1114, "trouble": 1628, "remaining": 1241, "tub": 1631, "kids": 805, "tops": 1607, "general": 602, "cosmetic": 309, "broken": 161, "understand": 1647, "exactly": 469, "excess": 470, "claims": 231, "protects": 1172, "calming": 182, "effect": 447, "terrible": 1566, "seal": 1320, "spent": 1460, "pair": 1072, "zero": 1755, "edges": 446, "wooden": 1731, "children": 220, "securely": 1327, "edge": 445, "stuck": 1516, "nozzle": 1019, "switch": 1539, "totally": 1609, "closed": 248, "powerful": 1143, "manufacturer": 933, "china": 222, "make sure": 920, "cheeks": 215, "fair": 511, "complexion": 284, "puffy": 1178, "shimmer": 1373, "magnetic": 911, "tangle": 1550, "weird": 1710, "key": 803, "lights": 866, "sorry": 1451, "flimsy": 561, "complaint": 280, "soon": 1449, "tested": 1569, "normal": 1011, "covers": 322, "speed": 1458, "pros": 1168, "charge": 209, "cool": 305, "means": 945, "replaced": 1251, "replacement": 1252, "section": 1325, "face feel": 501, "tools": 1605, "dab": 354, "ability": 0, "poor": 1133, "hasn": 689, "applies": 55, "harder": 686, "cure": 334, "future": 595, "include": 762, "safe": 1300, "left skin": 850, "higher": 716, "tear": 1558, "dryer": 432, "moment": 979, "offers": 1025, "build": 170, "benefits": 120, "maintain": 914, "decision": 375, "price point": 1154, "hair place": 663, "plenty": 1123, "delivered": 381, "friendly": 587, "certain": 201, "adjust": 24, "smelling": 1431, "drops": 428, "patches": 1082, "mean": 944, "ideal": 753, "snap": 1436, "relief": 1240, "diffuser": 399, "known": 811, "truly": 1630, "glow": 623, "deodorant": 385, "lasts long": 826, "advertised": 29, "durable": 436, "reusable": 1266, "average": 78, "choice": 224, "traditional": 1614, "primer": 1158, "delightful": 380, "rinses": 1276, "washes": 1687, "page": 1067, "terrific": 1567, "collagen": 258, "starts": 1484, "low": 907, "increase": 766, "arms": 64, "legs": 851, "avoid": 79, "glycerin": 625, "hydration": 751, "skin dry": 1410, "day night": 368, "vera": 1668, "aloe vera": 39, "hyaluronic": 746, "acid": 11, "hyaluronic acid": 747, "grey": 642, "conditioning": 290, "formula": 577, "control": 303, "sticks": 1495, "dog": 416, "lighter": 864, "vanilla": 1664, "thanks": 1574, "goes long": 628, "thanks taking": 1575, "taking read": 1548, "read hope": 1211, "hope information": 732, "information provided": 773, "decision easier": 376, "warm": 1682, "weather": 1704, "offer": 1024, "coverage": 320, "weren": 1712, "properly": 1167, "shipping": 1377, "provided makes": 1175, "makes decision": 922, "rid": 1271, "twice day": 1639, "healthy": 701, "barrier": 96, "redness": 1229, "irritated": 787, "lightweight absorbs": 868, "extract": 485, "healing": 699, "soaked": 1438, "benefit": 119, "cooling": 306, "dull": 435, "adds": 22, "spend": 1459, "sit": 1402, "oily skin": 1029, "skin feel": 1411, "sprayer": 1470, "sprays": 1471, "appreciate": 58, "treat": 1619, "contain": 298, "rosacea": 1285, "eczema": 444, "bright": 155, "fade": 508, "intense": 782, "refreshed": 1232, "stretchy": 1511, "heal": 698, "choose": 225, "alternative": 41, "chose": 226, "opened": 1037, "dewy": 395, "directly": 402, "rinse": 1274, "makes feel": 923, "body wash": 143, "form": 576, "delivery": 383, "parts": 1078, "paying": 1084, "admit": 26, "dollars": 418, "search": 1322, "likely": 870, "odd": 1022, "dead": 370, "shaving": 1363, "split": 1462, "painful": 1070, "dead skin": 371, "shaver": 1362, "trimmer": 1625, "house": 741, "twist": 1640, "create": 329, "specifically": 1457, "buying": 181, "blonde": 136, "stiff": 1497, "shades": 1353, "lash": 820, "skeptical": 1407, "fake": 513, "bulky": 172, "dress": 422, "asked": 72, "plug": 1124, "wigs": 1719, "party": 1079, "wonderfully": 1728, "affordable": 30, "instantly": 778, "cup": 332, "relaxing": 1239, "pre": 1145, "filled": 543, "wonders": 1729, "designs": 391, "charcoal": 208, "palette": 1074, "post": 1139, "consistent": 295, "tone": 1599, "moisturizes": 976, "areas": 60, "enjoyed": 457, "honey": 730, "usa": 1655, "testing": 1570, "minor": 961, "safety": 1301, "date": 362, "device": 394, "generally": 603, "plastic bag": 1116, "cotton": 313, "exfoliation": 476, "comfortably": 273, "salt": 1303, "glove": 621, "performance": 1091, "helped": 710, "sealed": 1321, "clearly": 242, "stone": 1499, "beautifully": 112, "beach": 108, "tones": 1601, "fabulous": 499, "lemon": 852, "face wash": 505, "goes smoothly": 630, "mineral": 958, "tired": 1594, "dip": 400, "lol": 888, "lamp": 817, "check": 214, "shampoos": 1357, "wash hair": 1685, "skin tone": 1419, "daughter loves": 365, "reach": 1207, "volume": 1677, "rinsed": 1275, "worry": 1740, "seed": 1328, "seed oil": 1329, "harsh": 688, "rating stars": 1205, "work hair": 1735, "incredible": 767, "pulling": 1182, "service": 1346, "make hair": 918, "customer service": 346, "reaction": 1208, "brighter": 156, "skin smooth": 1418, "makes skin": 925, "bed": 114, "interested": 783, "heard": 702, "leaf": 835, "main": 912, "itchy": 793, "learned": 838, "helping": 712, "niece": 1008, "multiple": 987, "basis": 103, "rubbing": 1293, "lotions": 901, "cleaned": 234, "cups": 333, "dirt": 403, "damp": 358, "wow": 1744, "mainly": 913, "worse": 1741, "told": 1597, "finished": 552, "keeps hair": 801, "weak": 1700, "hopes": 735, "ponytail": 1132, "seriously": 1343, "anymore": 46, "cuticle": 350, "cuticles": 351, "person": 1094, "paid": 1068, "term": 1564, "softness": 1443, "purchasing": 1186, "bumps": 173, "video": 1672, "stronger": 1515, "returning": 1265, "complaints": 281, "trip": 1627, "root": 1283, "eyeliner": 495, "kinds": 808, "makeup remover": 927, "eye shadow": 490, "frizzy": 590, "friends": 588, "shouldn": 1385, "frequently": 584, "compliments": 285, "pleasantly": 1120, "pleasantly surprised": 1121, "glitter": 619, "inexpensive": 771, "dust": 437, "clothes": 250, "effort": 450, "upper": 1654, "dentist": 384, "refund": 1234, "professional": 1166, "fuller": 591, "forever": 574, "fast shipping": 523, "scissors": 1315, "veins": 1667, "realistic": 1216, "beard": 109, "repurchase": 1253, "taste": 1554, "model": 969, "trimming": 1626, "doesnt": 415, "sadly": 1299, "returned": 1264, "cutting": 353, "cuts": 352, "push": 1192, "awful": 82, "write": 1748, "suction": 1522, "trim": 1624, "meant": 946, "pad": 1065, "packs": 1064, "perfumes": 1093, "catch": 194, "pony": 1131, "cleanse": 238, "protection": 1171, "straight hair": 1506, "accurate": 10, "stickers": 1494, "disappointing": 406, "wedding": 1706, "online": 1035, "boxes": 150, "false": 516, "crap": 324, "family friends": 518, "convenient": 304, "moist": 970, "kinda": 807, "pull hair": 1180, "pro": 1160, "semi": 1335, "green tea": 641, "didnt": 396, "began": 115, "stain": 1475, "wears": 1703, "disappear": 404, "tint": 1590, "send": 1336, "birthday": 126, "carefully": 189, "lasts day": 825, "containers": 300, "darker": 361, "figured": 540, "terms": 1565, "reapply": 1219, "thoroughly": 1581, "bits": 127, "sad": 1298, "learn": 837, "fix": 556, "sitting": 1403, "nicer": 1007, "growing": 645, "blended": 133, "soaps": 1440, "gray": 638, "obviously": 1021, "discount": 408, "table": 1541, "tends": 1563, "skin felt": 1414, "supply": 1529, "coloring": 264, "intended": 781, "attachments": 74, "youtube": 1754, "videos": 1674, "costume": 312, "shop": 1378, "shut": 1389, "spring": 1473, "base coat": 99, "tattoos": 1555, "child": 219, "batteries": 106, "curling": 337, "curler": 336, "click": 243, "machine": 910, "drill": 425, "sparkly": 1455, "features": 527, "glasses": 618, "tons": 1602, "real hair": 1215, "quality price": 1195, "straightening": 1509, "human": 743, "styles": 1519, "shot": 1382, "dramatic": 421, "hair color": 652, "residue skin": 1258, "overpriced": 1058, "learning": 839, "curling iron": 338, "tangled": 1551, "ask": 71, "pigmented": 1106, "gave stars": 598, "companies": 277, "lace": 815, "constantly": 296, "bent": 121, "french": 583, "stays day": 1490, "sister": 1401, "cheaply": 213, "rebecca": 1225, "beat": 110, "inch": 760, "arrive": 66, "hair dryer": 654, "feedback": 528}